identification division.    * This section defines the identification properties of the program, such as the program name and author.

program-id.  base_jb.       * The name of the program is base\_jb.

date-written.  7-jul-1995 - mb.   * The program was written on July 7, 1995 by MB.

data division.               * This section defines the data that will be used in the program.

working-storage section.     * This subsection of the data division defines the working storage variables, which are variables that are only accessible within the current program.

procedure division.           * This section contains the main logic of the program.

