IDENTIFICATION DIVISION.  * This division defines the identification properties of the program such as the program name and date written.
PROGRAM-ID.  BaseConverter.   * The name of the program is BaseConverter.

DATE-WRITTEN.  07-MAR-199   * The program was written on March 7, 1999.

